/** @type {import('tailwindcss').Config} */
export default {
  content: ["./src/**/*.{js,ts,jsx,tsx}"],
  theme: {
// تمامی مواردی که به ظاهر وبسایت مربوط میشه توی این قسمت میایم شخصی سازی میکنیم مثل سایزها و رنگ ها و اسپیسینگ ها 
// اگر ما خاستیم یک پراپرتی رو به کل تغییر بدیم توی تلویند یعنی مقادیر قبلی که تلویند داره رو پاک کنیم و اونایی که خودمون داریم رو بنویسیمم مستقیما داخل ابجکت تک مینویسیم 
    extend: {
// اما اگر میخاید یک سری فیچری رو به مواردی که از قبل توی تلویند داره اضافه کنیم که دسترسی به خود مقادیر تلویند هم داشته باشیم توی اگزتند این روش رو انجام میدین از معنیشم مشخصه گسترش دادن که صرفا میخای اون قسمت اسپیسنگ رو گسترش بدی  
      container: {
        center: true,
        padding: '.5rem',
      },
      colors: {
        "primary": {
          DEFAULT: "#CCFF90",
          100: "#B2FF59",
          200: "#76FF03",
          // این اعداد اختیاری هستن هر چیزی دیگیری میشه جایگزین کرد
        }
      },
      screens: {
        // "primary": ""
        "fullCenter": "h-screen bg-black text-white d-flex justify-center item-center"
      }
    },

  },
  plugins: [],
}

